{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "fabe5450",
   "metadata": {},
   "source": [
    "# Knowledge Graph Querying: Competency Questions (CQs)\n",
    "This notebook shows how to query KGs to answer the CQs related to the OntoBOT ontology.\n",
    "\n",
    "We will:\n",
    "- load local RDF graphs\n",
    "- Formulate SPARQL queries corresponding to CQ"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5792c2f8",
   "metadata": {},
   "source": [
    "#### 🔧 Setup 🔧"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 59,
   "id": "40d0124d",
   "metadata": {},
   "outputs": [],
   "source": [
    "from rdflib import Graph, Namespace\n",
    "from collections import defaultdict\n",
    "import pandas as pd"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 60,
   "id": "1ea3c18b",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<Graph identifier=Nb820611b330c47b9ad5becf13190614b (<class 'rdflib.graph.Graph'>)>"
      ]
     },
     "execution_count": 60,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Load activity 'Prepare breakfast' graph\n",
    "g_activity1 = Graph()\n",
    "g_activity1.parse(\"KGs/activity-1.ttl\", format=\"ttl\")\n",
    "\n",
    "# Load activity 'Reorganise the kitchen' graph\n",
    "g_activity2 = Graph()\n",
    "g_activity2.parse(\"KGs/activity-2.ttl\", format=\"ttl\")\n",
    "\n",
    "# Load environment graph\n",
    "g_environment = Graph()\n",
    "g_environment.parse(\"KGs/environment.ttl\", format=\"ttl\")\n",
    "\n",
    "# Load robots graph\n",
    "g_robots = Graph()\n",
    "g_robots.parse(\"KGs/robots.ttl\", format=\"ttl\")  "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 61,
   "id": "545d83b7",
   "metadata": {},
   "outputs": [],
   "source": [
    "EX = Namespace(\"https://example.org/\")\n",
    "OBOT = Namespace(\"https://w3id.org/onto-bot#\")\n",
    "PKO = Namespace(\"https://w3id.org/pko#\")\n",
    "SOMA = Namespace(\"http://www.ease-crc.org/ont/SOMA.owl#\")\n",
    "PROV = Namespace(\"http://www.w3.org/ns/prov#\")\n",
    "\n",
    "for g in [g_activity1, g_activity2, g_environment, g_robots]:\n",
    "    g.bind(\"ex\", EX)\n",
    "    g.bind(\"obot\", OBOT)\n",
    "    g.bind(\"pko\", PKO)\n",
    "    g.bind(\"soma\", SOMA)\n",
    "    g.bind(\"prov\", PROV)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "657b894a",
   "metadata": {},
   "source": [
    "#### 🤖 CQ 1 🤖\n",
    "\n",
    "**What objects and their associated affordances are involved in the activity _\"Prepare breakfast\"_?**"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 62,
   "id": "1116d0f2",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "application/vnd.microsoft.datawrangler.viewer.v0+json": {
       "columns": [
        {
         "name": "index",
         "rawType": "int64",
         "type": "integer"
        },
        {
         "name": "Object",
         "rawType": "object",
         "type": "string"
        },
        {
         "name": "Affordance",
         "rawType": "object",
         "type": "string"
        }
       ],
       "ref": "32755e41-22ff-48ff-9e58-fa6cf5104708",
       "rows": [
        [
         "0",
         "https://example.org/tablewareCupboard",
         "http://www.ease-crc.org/ont/SOMA.owl#Opening"
        ],
        [
         "1",
         "https://example.org/tablewareCupboard",
         "http://www.ease-crc.org/ont/SOMA.owl#Closing"
        ],
        [
         "2",
         "https://example.org/bowl",
         "http://www.ease-crc.org/ont/SOMA.owl#Grasping"
        ],
        [
         "3",
         "https://example.org/bowl",
         "http://www.ease-crc.org/ont/SOMA.owl#Holding"
        ],
        [
         "4",
         "https://example.org/bowl",
         "http://www.ease-crc.org/ont/SOMA.owl#Placing"
        ],
        [
         "5",
         "https://example.org/drawer",
         "http://www.ease-crc.org/ont/SOMA.owl#Opening"
        ],
        [
         "6",
         "https://example.org/drawer",
         "http://www.ease-crc.org/ont/SOMA.owl#Closing"
        ],
        [
         "7",
         "https://example.org/spoon",
         "http://www.ease-crc.org/ont/SOMA.owl#Grasping"
        ],
        [
         "8",
         "https://example.org/spoon",
         "http://www.ease-crc.org/ont/SOMA.owl#Holding"
        ],
        [
         "9",
         "https://example.org/spoon",
         "http://www.ease-crc.org/ont/SOMA.owl#Placing"
        ],
        [
         "10",
         "https://example.org/glass",
         "http://www.ease-crc.org/ont/SOMA.owl#Grasping"
        ],
        [
         "11",
         "https://example.org/glass",
         "http://www.ease-crc.org/ont/SOMA.owl#Holding"
        ],
        [
         "12",
         "https://example.org/glass",
         "http://www.ease-crc.org/ont/SOMA.owl#Placing"
        ],
        [
         "13",
         "https://example.org/fridge",
         "http://www.ease-crc.org/ont/SOMA.owl#Opening"
        ],
        [
         "14",
         "https://example.org/fridge",
         "http://www.ease-crc.org/ont/SOMA.owl#Closing"
        ],
        [
         "15",
         "https://example.org/milk",
         "http://www.ease-crc.org/ont/SOMA.owl#Grasping"
        ],
        [
         "16",
         "https://example.org/milk",
         "http://www.ease-crc.org/ont/SOMA.owl#Holding"
        ],
        [
         "17",
         "https://example.org/milk",
         "http://www.ease-crc.org/ont/SOMA.owl#Placing"
        ],
        [
         "18",
         "https://example.org/milk",
         "http://www.ease-crc.org/ont/SOMA.owl#Pouring"
        ],
        [
         "19",
         "https://example.org/milk",
         "http://www.ease-crc.org/ont/SOMA.owl#PuttingDown"
        ],
        [
         "20",
         "https://example.org/orangeJuice",
         "http://www.ease-crc.org/ont/SOMA.owl#Grasping"
        ],
        [
         "21",
         "https://example.org/orangeJuice",
         "http://www.ease-crc.org/ont/SOMA.owl#Holding"
        ],
        [
         "22",
         "https://example.org/orangeJuice",
         "http://www.ease-crc.org/ont/SOMA.owl#Placing"
        ],
        [
         "23",
         "https://example.org/orangeJuice",
         "http://www.ease-crc.org/ont/SOMA.owl#Pouring"
        ],
        [
         "24",
         "https://example.org/orangeJuice",
         "http://www.ease-crc.org/ont/SOMA.owl#PuttingDown"
        ],
        [
         "25",
         "https://example.org/foodCupboard",
         "http://www.ease-crc.org/ont/SOMA.owl#Opening"
        ],
        [
         "26",
         "https://example.org/foodCupboard",
         "http://www.ease-crc.org/ont/SOMA.owl#Closing"
        ],
        [
         "27",
         "https://example.org/cerealBox",
         "http://www.ease-crc.org/ont/SOMA.owl#Grasping"
        ],
        [
         "28",
         "https://example.org/cerealBox",
         "http://www.ease-crc.org/ont/SOMA.owl#Holding"
        ],
        [
         "29",
         "https://example.org/cerealBox",
         "http://www.ease-crc.org/ont/SOMA.owl#Placing"
        ],
        [
         "30",
         "https://example.org/cerealBox",
         "http://www.ease-crc.org/ont/SOMA.owl#Pouring"
        ],
        [
         "31",
         "https://example.org/cerealBox",
         "http://www.ease-crc.org/ont/SOMA.owl#PuttingDown"
        ]
       ],
       "shape": {
        "columns": 2,
        "rows": 32
       }
      },
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Object</th>\n",
       "      <th>Affordance</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>https://example.org/tablewareCupboard</td>\n",
       "      <td>http://www.ease-crc.org/ont/SOMA.owl#Opening</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>https://example.org/tablewareCupboard</td>\n",
       "      <td>http://www.ease-crc.org/ont/SOMA.owl#Closing</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>https://example.org/bowl</td>\n",
       "      <td>http://www.ease-crc.org/ont/SOMA.owl#Grasping</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>https://example.org/bowl</td>\n",
       "      <td>http://www.ease-crc.org/ont/SOMA.owl#Holding</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>https://example.org/bowl</td>\n",
       "      <td>http://www.ease-crc.org/ont/SOMA.owl#Placing</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>https://example.org/drawer</td>\n",
       "      <td>http://www.ease-crc.org/ont/SOMA.owl#Opening</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>https://example.org/drawer</td>\n",
       "      <td>http://www.ease-crc.org/ont/SOMA.owl#Closing</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>https://example.org/spoon</td>\n",
       "      <td>http://www.ease-crc.org/ont/SOMA.owl#Grasping</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>https://example.org/spoon</td>\n",
       "      <td>http://www.ease-crc.org/ont/SOMA.owl#Holding</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>https://example.org/spoon</td>\n",
       "      <td>http://www.ease-crc.org/ont/SOMA.owl#Placing</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>https://example.org/glass</td>\n",
       "      <td>http://www.ease-crc.org/ont/SOMA.owl#Grasping</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>https://example.org/glass</td>\n",
       "      <td>http://www.ease-crc.org/ont/SOMA.owl#Holding</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>https://example.org/glass</td>\n",
       "      <td>http://www.ease-crc.org/ont/SOMA.owl#Placing</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>https://example.org/fridge</td>\n",
       "      <td>http://www.ease-crc.org/ont/SOMA.owl#Opening</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>https://example.org/fridge</td>\n",
       "      <td>http://www.ease-crc.org/ont/SOMA.owl#Closing</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>https://example.org/milk</td>\n",
       "      <td>http://www.ease-crc.org/ont/SOMA.owl#Grasping</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>https://example.org/milk</td>\n",
       "      <td>http://www.ease-crc.org/ont/SOMA.owl#Holding</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>https://example.org/milk</td>\n",
       "      <td>http://www.ease-crc.org/ont/SOMA.owl#Placing</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>https://example.org/milk</td>\n",
       "      <td>http://www.ease-crc.org/ont/SOMA.owl#Pouring</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>https://example.org/milk</td>\n",
       "      <td>http://www.ease-crc.org/ont/SOMA.owl#PuttingDown</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>https://example.org/orangeJuice</td>\n",
       "      <td>http://www.ease-crc.org/ont/SOMA.owl#Grasping</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>https://example.org/orangeJuice</td>\n",
       "      <td>http://www.ease-crc.org/ont/SOMA.owl#Holding</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>https://example.org/orangeJuice</td>\n",
       "      <td>http://www.ease-crc.org/ont/SOMA.owl#Placing</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>https://example.org/orangeJuice</td>\n",
       "      <td>http://www.ease-crc.org/ont/SOMA.owl#Pouring</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>https://example.org/orangeJuice</td>\n",
       "      <td>http://www.ease-crc.org/ont/SOMA.owl#PuttingDown</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>https://example.org/foodCupboard</td>\n",
       "      <td>http://www.ease-crc.org/ont/SOMA.owl#Opening</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>https://example.org/foodCupboard</td>\n",
       "      <td>http://www.ease-crc.org/ont/SOMA.owl#Closing</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>https://example.org/cerealBox</td>\n",
       "      <td>http://www.ease-crc.org/ont/SOMA.owl#Grasping</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>https://example.org/cerealBox</td>\n",
       "      <td>http://www.ease-crc.org/ont/SOMA.owl#Holding</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>https://example.org/cerealBox</td>\n",
       "      <td>http://www.ease-crc.org/ont/SOMA.owl#Placing</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>https://example.org/cerealBox</td>\n",
       "      <td>http://www.ease-crc.org/ont/SOMA.owl#Pouring</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>31</th>\n",
       "      <td>https://example.org/cerealBox</td>\n",
       "      <td>http://www.ease-crc.org/ont/SOMA.owl#PuttingDown</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                   Object  \\\n",
       "0   https://example.org/tablewareCupboard   \n",
       "1   https://example.org/tablewareCupboard   \n",
       "2                https://example.org/bowl   \n",
       "3                https://example.org/bowl   \n",
       "4                https://example.org/bowl   \n",
       "5              https://example.org/drawer   \n",
       "6              https://example.org/drawer   \n",
       "7               https://example.org/spoon   \n",
       "8               https://example.org/spoon   \n",
       "9               https://example.org/spoon   \n",
       "10              https://example.org/glass   \n",
       "11              https://example.org/glass   \n",
       "12              https://example.org/glass   \n",
       "13             https://example.org/fridge   \n",
       "14             https://example.org/fridge   \n",
       "15               https://example.org/milk   \n",
       "16               https://example.org/milk   \n",
       "17               https://example.org/milk   \n",
       "18               https://example.org/milk   \n",
       "19               https://example.org/milk   \n",
       "20        https://example.org/orangeJuice   \n",
       "21        https://example.org/orangeJuice   \n",
       "22        https://example.org/orangeJuice   \n",
       "23        https://example.org/orangeJuice   \n",
       "24        https://example.org/orangeJuice   \n",
       "25       https://example.org/foodCupboard   \n",
       "26       https://example.org/foodCupboard   \n",
       "27          https://example.org/cerealBox   \n",
       "28          https://example.org/cerealBox   \n",
       "29          https://example.org/cerealBox   \n",
       "30          https://example.org/cerealBox   \n",
       "31          https://example.org/cerealBox   \n",
       "\n",
       "                                          Affordance  \n",
       "0       http://www.ease-crc.org/ont/SOMA.owl#Opening  \n",
       "1       http://www.ease-crc.org/ont/SOMA.owl#Closing  \n",
       "2      http://www.ease-crc.org/ont/SOMA.owl#Grasping  \n",
       "3       http://www.ease-crc.org/ont/SOMA.owl#Holding  \n",
       "4       http://www.ease-crc.org/ont/SOMA.owl#Placing  \n",
       "5       http://www.ease-crc.org/ont/SOMA.owl#Opening  \n",
       "6       http://www.ease-crc.org/ont/SOMA.owl#Closing  \n",
       "7      http://www.ease-crc.org/ont/SOMA.owl#Grasping  \n",
       "8       http://www.ease-crc.org/ont/SOMA.owl#Holding  \n",
       "9       http://www.ease-crc.org/ont/SOMA.owl#Placing  \n",
       "10     http://www.ease-crc.org/ont/SOMA.owl#Grasping  \n",
       "11      http://www.ease-crc.org/ont/SOMA.owl#Holding  \n",
       "12      http://www.ease-crc.org/ont/SOMA.owl#Placing  \n",
       "13      http://www.ease-crc.org/ont/SOMA.owl#Opening  \n",
       "14      http://www.ease-crc.org/ont/SOMA.owl#Closing  \n",
       "15     http://www.ease-crc.org/ont/SOMA.owl#Grasping  \n",
       "16      http://www.ease-crc.org/ont/SOMA.owl#Holding  \n",
       "17      http://www.ease-crc.org/ont/SOMA.owl#Placing  \n",
       "18      http://www.ease-crc.org/ont/SOMA.owl#Pouring  \n",
       "19  http://www.ease-crc.org/ont/SOMA.owl#PuttingDown  \n",
       "20     http://www.ease-crc.org/ont/SOMA.owl#Grasping  \n",
       "21      http://www.ease-crc.org/ont/SOMA.owl#Holding  \n",
       "22      http://www.ease-crc.org/ont/SOMA.owl#Placing  \n",
       "23      http://www.ease-crc.org/ont/SOMA.owl#Pouring  \n",
       "24  http://www.ease-crc.org/ont/SOMA.owl#PuttingDown  \n",
       "25      http://www.ease-crc.org/ont/SOMA.owl#Opening  \n",
       "26      http://www.ease-crc.org/ont/SOMA.owl#Closing  \n",
       "27     http://www.ease-crc.org/ont/SOMA.owl#Grasping  \n",
       "28      http://www.ease-crc.org/ont/SOMA.owl#Holding  \n",
       "29      http://www.ease-crc.org/ont/SOMA.owl#Placing  \n",
       "30      http://www.ease-crc.org/ont/SOMA.owl#Pouring  \n",
       "31  http://www.ease-crc.org/ont/SOMA.owl#PuttingDown  "
      ]
     },
     "execution_count": 62,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cq1 = \"\"\"\n",
    "PREFIX obot: <https://w3id.org/onto-bot#>\n",
    "PREFIX pko: <https://w3id.org/pko#>\n",
    "\n",
    "SELECT DISTINCT ?object ?affordance\n",
    "WHERE {\n",
    "    ?action obot:actsOn ?object ;\n",
    "        obot:requiresAffordance ?affordance . }\n",
    "\"\"\"\n",
    "\n",
    "results_cq1 = g_activity1.query(cq1)\n",
    "df_cq1 = pd.DataFrame([(str(row.object), str(row.affordance)) for row in results_cq1],\n",
    "                        columns=[\"Object\", \"Affordance\"])\n",
    "df_cq1"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e7710bbb",
   "metadata": {},
   "source": [
    "#### 🤖 CQ 2 🤖\n",
    "\n",
    "**What is the required sequence of actions to complete the _\"Prepare breakfast\"_ activity?**"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "8209306a",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "application/vnd.microsoft.datawrangler.viewer.v0+json": {
       "columns": [
        {
         "name": "index",
         "rawType": "int64",
         "type": "integer"
        },
        {
         "name": "Procedure",
         "rawType": "object",
         "type": "string"
        },
        {
         "name": "Step",
         "rawType": "object",
         "type": "string"
        },
        {
         "name": "Action",
         "rawType": "object",
         "type": "string"
        }
       ],
       "ref": "ea850d48-ba44-430c-b80c-82ec7d71cf0b",
       "rows": [
        [
         "0",
         "Retrieve tableware",
         "Retrieve bowl",
         "Open the cupboard"
        ],
        [
         "1",
         "Retrieve tableware",
         "Retrieve bowl",
         "Grasp the bowl"
        ],
        [
         "2",
         "Retrieve tableware",
         "Retrieve bowl",
         "Place the bowl on the table"
        ],
        [
         "3",
         "Retrieve tableware",
         "Retrieve bowl",
         "Close the cupboard"
        ],
        [
         "4",
         "Retrieve tableware",
         "Retrieve spoon",
         "Open the drawer"
        ],
        [
         "5",
         "Retrieve tableware",
         "Retrieve spoon",
         "Grasp the spoon"
        ],
        [
         "6",
         "Retrieve tableware",
         "Retrieve spoon",
         "Place the spoon on the table"
        ],
        [
         "7",
         "Retrieve tableware",
         "Retrieve spoon",
         "Close the drawer"
        ],
        [
         "8",
         "Retrieve tableware",
         "Retrieve glass",
         "Open the cupboard"
        ],
        [
         "9",
         "Retrieve tableware",
         "Retrieve glass",
         "Grasp the glass"
        ],
        [
         "10",
         "Retrieve tableware",
         "Retrieve glass",
         "Place the glass on the table"
        ],
        [
         "11",
         "Retrieve tableware",
         "Retrieve glass",
         "Close the cupboard"
        ],
        [
         "12",
         "Retrieve food",
         "Retrieve milk",
         "Open the fridge"
        ],
        [
         "13",
         "Retrieve food",
         "Retrieve milk",
         "Grasp the milk"
        ],
        [
         "14",
         "Retrieve food",
         "Retrieve milk",
         "Place the milk on the table"
        ],
        [
         "15",
         "Retrieve food",
         "Retrieve milk",
         "Close the fridge"
        ],
        [
         "16",
         "Retrieve food",
         "Retrieve orange juice",
         "Open the fridge"
        ],
        [
         "17",
         "Retrieve food",
         "Retrieve orange juice",
         "Grasp the orange juice"
        ],
        [
         "18",
         "Retrieve food",
         "Retrieve orange juice",
         "Place the orange juice on the table"
        ],
        [
         "19",
         "Retrieve food",
         "Retrieve orange juice",
         "Close the fridge"
        ],
        [
         "20",
         "Retrieve food",
         "Retrieve cereal",
         "Open the cupboard"
        ],
        [
         "21",
         "Retrieve food",
         "Retrieve cereal",
         "Grasp the cereal box"
        ],
        [
         "22",
         "Retrieve food",
         "Retrieve cereal",
         "Place the cereal box on the table"
        ],
        [
         "23",
         "Retrieve food",
         "Retrieve cereal",
         "Close the cupboard"
        ],
        [
         "24",
         "Prepare breakfast",
         "Serve milk",
         "Grasp the milk"
        ],
        [
         "25",
         "Prepare breakfast",
         "Serve milk",
         "Pour milk into the bowl"
        ],
        [
         "26",
         "Prepare breakfast",
         "Serve milk",
         "Put milk down"
        ],
        [
         "27",
         "Prepare breakfast",
         "Serve orange juice",
         "Grasp the orange juice"
        ],
        [
         "28",
         "Prepare breakfast",
         "Serve orange juice",
         "Pour orange juice into the glass"
        ],
        [
         "29",
         "Prepare breakfast",
         "Serve orange juice",
         "Put orange juice down"
        ],
        [
         "30",
         "Prepare breakfast",
         "Serve cereal",
         "Grasp the cereal box"
        ],
        [
         "31",
         "Prepare breakfast",
         "Serve cereal",
         "Pour cereal into the bowl"
        ],
        [
         "32",
         "Prepare breakfast",
         "Serve cereal",
         "Put cereal box down"
        ]
       ],
       "shape": {
        "columns": 3,
        "rows": 33
       }
      },
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Procedure</th>\n",
       "      <th>Step</th>\n",
       "      <th>Action</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Retrieve tableware</td>\n",
       "      <td>Retrieve bowl</td>\n",
       "      <td>Open the cupboard</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Retrieve tableware</td>\n",
       "      <td>Retrieve bowl</td>\n",
       "      <td>Grasp the bowl</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Retrieve tableware</td>\n",
       "      <td>Retrieve bowl</td>\n",
       "      <td>Place the bowl on the table</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Retrieve tableware</td>\n",
       "      <td>Retrieve bowl</td>\n",
       "      <td>Close the cupboard</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Retrieve tableware</td>\n",
       "      <td>Retrieve spoon</td>\n",
       "      <td>Open the drawer</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Retrieve tableware</td>\n",
       "      <td>Retrieve spoon</td>\n",
       "      <td>Grasp the spoon</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Retrieve tableware</td>\n",
       "      <td>Retrieve spoon</td>\n",
       "      <td>Place the spoon on the table</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Retrieve tableware</td>\n",
       "      <td>Retrieve spoon</td>\n",
       "      <td>Close the drawer</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Retrieve tableware</td>\n",
       "      <td>Retrieve glass</td>\n",
       "      <td>Open the cupboard</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Retrieve tableware</td>\n",
       "      <td>Retrieve glass</td>\n",
       "      <td>Grasp the glass</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>Retrieve tableware</td>\n",
       "      <td>Retrieve glass</td>\n",
       "      <td>Place the glass on the table</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>Retrieve tableware</td>\n",
       "      <td>Retrieve glass</td>\n",
       "      <td>Close the cupboard</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>Retrieve food</td>\n",
       "      <td>Retrieve milk</td>\n",
       "      <td>Open the fridge</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>Retrieve food</td>\n",
       "      <td>Retrieve milk</td>\n",
       "      <td>Grasp the milk</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>Retrieve food</td>\n",
       "      <td>Retrieve milk</td>\n",
       "      <td>Place the milk on the table</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>Retrieve food</td>\n",
       "      <td>Retrieve milk</td>\n",
       "      <td>Close the fridge</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>Retrieve food</td>\n",
       "      <td>Retrieve orange juice</td>\n",
       "      <td>Open the fridge</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>Retrieve food</td>\n",
       "      <td>Retrieve orange juice</td>\n",
       "      <td>Grasp the orange juice</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>Retrieve food</td>\n",
       "      <td>Retrieve orange juice</td>\n",
       "      <td>Place the orange juice on the table</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>Retrieve food</td>\n",
       "      <td>Retrieve orange juice</td>\n",
       "      <td>Close the fridge</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>Retrieve food</td>\n",
       "      <td>Retrieve cereal</td>\n",
       "      <td>Open the cupboard</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>Retrieve food</td>\n",
       "      <td>Retrieve cereal</td>\n",
       "      <td>Grasp the cereal box</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>Retrieve food</td>\n",
       "      <td>Retrieve cereal</td>\n",
       "      <td>Place the cereal box on the table</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>Retrieve food</td>\n",
       "      <td>Retrieve cereal</td>\n",
       "      <td>Close the cupboard</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>Prepare breakfast</td>\n",
       "      <td>Serve milk</td>\n",
       "      <td>Grasp the milk</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>Prepare breakfast</td>\n",
       "      <td>Serve milk</td>\n",
       "      <td>Pour milk into the bowl</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>Prepare breakfast</td>\n",
       "      <td>Serve milk</td>\n",
       "      <td>Put milk down</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>Prepare breakfast</td>\n",
       "      <td>Serve orange juice</td>\n",
       "      <td>Grasp the orange juice</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>Prepare breakfast</td>\n",
       "      <td>Serve orange juice</td>\n",
       "      <td>Pour orange juice into the glass</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>Prepare breakfast</td>\n",
       "      <td>Serve orange juice</td>\n",
       "      <td>Put orange juice down</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>Prepare breakfast</td>\n",
       "      <td>Serve cereal</td>\n",
       "      <td>Grasp the cereal box</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>31</th>\n",
       "      <td>Prepare breakfast</td>\n",
       "      <td>Serve cereal</td>\n",
       "      <td>Pour cereal into the bowl</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>32</th>\n",
       "      <td>Prepare breakfast</td>\n",
       "      <td>Serve cereal</td>\n",
       "      <td>Put cereal box down</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "             Procedure                   Step  \\\n",
       "0   Retrieve tableware          Retrieve bowl   \n",
       "1   Retrieve tableware          Retrieve bowl   \n",
       "2   Retrieve tableware          Retrieve bowl   \n",
       "3   Retrieve tableware          Retrieve bowl   \n",
       "4   Retrieve tableware         Retrieve spoon   \n",
       "5   Retrieve tableware         Retrieve spoon   \n",
       "6   Retrieve tableware         Retrieve spoon   \n",
       "7   Retrieve tableware         Retrieve spoon   \n",
       "8   Retrieve tableware         Retrieve glass   \n",
       "9   Retrieve tableware         Retrieve glass   \n",
       "10  Retrieve tableware         Retrieve glass   \n",
       "11  Retrieve tableware         Retrieve glass   \n",
       "12       Retrieve food          Retrieve milk   \n",
       "13       Retrieve food          Retrieve milk   \n",
       "14       Retrieve food          Retrieve milk   \n",
       "15       Retrieve food          Retrieve milk   \n",
       "16       Retrieve food  Retrieve orange juice   \n",
       "17       Retrieve food  Retrieve orange juice   \n",
       "18       Retrieve food  Retrieve orange juice   \n",
       "19       Retrieve food  Retrieve orange juice   \n",
       "20       Retrieve food        Retrieve cereal   \n",
       "21       Retrieve food        Retrieve cereal   \n",
       "22       Retrieve food        Retrieve cereal   \n",
       "23       Retrieve food        Retrieve cereal   \n",
       "24   Prepare breakfast             Serve milk   \n",
       "25   Prepare breakfast             Serve milk   \n",
       "26   Prepare breakfast             Serve milk   \n",
       "27   Prepare breakfast     Serve orange juice   \n",
       "28   Prepare breakfast     Serve orange juice   \n",
       "29   Prepare breakfast     Serve orange juice   \n",
       "30   Prepare breakfast           Serve cereal   \n",
       "31   Prepare breakfast           Serve cereal   \n",
       "32   Prepare breakfast           Serve cereal   \n",
       "\n",
       "                                 Action  \n",
       "0                     Open the cupboard  \n",
       "1                        Grasp the bowl  \n",
       "2           Place the bowl on the table  \n",
       "3                    Close the cupboard  \n",
       "4                       Open the drawer  \n",
       "5                       Grasp the spoon  \n",
       "6          Place the spoon on the table  \n",
       "7                      Close the drawer  \n",
       "8                     Open the cupboard  \n",
       "9                       Grasp the glass  \n",
       "10         Place the glass on the table  \n",
       "11                   Close the cupboard  \n",
       "12                      Open the fridge  \n",
       "13                       Grasp the milk  \n",
       "14          Place the milk on the table  \n",
       "15                     Close the fridge  \n",
       "16                      Open the fridge  \n",
       "17               Grasp the orange juice  \n",
       "18  Place the orange juice on the table  \n",
       "19                     Close the fridge  \n",
       "20                    Open the cupboard  \n",
       "21                 Grasp the cereal box  \n",
       "22    Place the cereal box on the table  \n",
       "23                   Close the cupboard  \n",
       "24                       Grasp the milk  \n",
       "25              Pour milk into the bowl  \n",
       "26                        Put milk down  \n",
       "27               Grasp the orange juice  \n",
       "28     Pour orange juice into the glass  \n",
       "29                Put orange juice down  \n",
       "30                 Grasp the cereal box  \n",
       "31            Pour cereal into the bowl  \n",
       "32                  Put cereal box down  "
      ]
     },
     "execution_count": 63,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cq2 = \"\"\"\n",
    "PREFIX pko: <https://w3id.org/pko#>\n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "\n",
    "SELECT DISTINCT ?activity ?procedureLabel ?stepLabel ?actionLabel\n",
    "WHERE {\n",
    "  ?activity pko:hasUserQuestionOccurrence ?uqo ;\n",
    "      pko:executesProcedure ?procedure .\n",
    "  ?uqo rdfs:label \"Prepare breakfast\" .\n",
    "  ?procedure rdfs:label ?procedureLabel ;\n",
    "      pko:hasStep ?step .\n",
    "  ?step rdfs:label ?stepLabel ;\n",
    "      pko:requiresAction ?action .\n",
    "  ?action rdfs:label ?actionLabel . }\n",
    "\"\"\"\n",
    "\n",
    "results_cq2 = g_activity1.query(cq2)\n",
    "df_cq2 = pd.DataFrame(\n",
    "    [(str(row.procedureLabel), str(row.stepLabel), str(row.actionLabel)) for row in results_cq2],\n",
    "    columns=[\"Procedure\", \"Step\", \"Action\"])\n",
    "df_cq2"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "bb3cfdd0",
   "metadata": {},
   "source": [
    "#### 🤖 CQ 3 🤖\n",
    "\n",
    "**What capabilities are required for a robot to perform a given activity?**"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "480b6f64",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "                              Required Capabilities\n",
      "0      http://www.ease-crc.org/ont/SOMA.owl#Opening\n",
      "1     http://www.ease-crc.org/ont/SOMA.owl#Grasping\n",
      "2      http://www.ease-crc.org/ont/SOMA.owl#Holding\n",
      "3      http://www.ease-crc.org/ont/SOMA.owl#Placing\n",
      "4      http://www.ease-crc.org/ont/SOMA.owl#Closing\n",
      "5      http://www.ease-crc.org/ont/SOMA.owl#Pouring\n",
      "6  http://www.ease-crc.org/ont/SOMA.owl#PuttingDown\n",
      "                           Required Capabilities\n",
      "0  http://www.ease-crc.org/ont/SOMA.owl#Grasping\n",
      "1   http://www.ease-crc.org/ont/SOMA.owl#Holding\n",
      "2   http://www.ease-crc.org/ont/SOMA.owl#Opening\n",
      "3   http://www.ease-crc.org/ont/SOMA.owl#Placing\n",
      "4   http://www.ease-crc.org/ont/SOMA.owl#Closing\n"
     ]
    }
   ],
   "source": [
    "cq3 = \"\"\"\n",
    "PREFIX obot: <https://w3id.org/onto-bot#>\n",
    "PREFIX pko: <https://w3id.org/pko#>\n",
    "PREFIX prov: <http://www.w3.org/ns/prov#>\n",
    "\n",
    "SELECT DISTINCT ?affordance\n",
    "WHERE {\n",
    "  ?activity pko:executesProcedure ?procedure .\n",
    "  ?procedure pko:hasStep ?step .\n",
    "  ?step pko:requiresAction ?action .\n",
    "  ?action obot:requiresAffordance ?affordance . }\n",
    "\"\"\"\n",
    "\n",
    "results_cq3_activity1 = g_activity1.query(cq3)\n",
    "results_cq3_activity2 = g_activity2.query(cq3)\n",
    "df_cq3_activity1 = pd.DataFrame([str(row.affordance) for row in results_cq3_activity1], \n",
    "                                columns=[\"Required Capabilities\"])\n",
    "df_cq3_activity2 = pd.DataFrame([str(row.affordance) for row in results_cq3_activity2], \n",
    "                                columns=[\"Required Capabilities\"])\n",
    "print(df_cq3_activity1)\n",
    "print(df_cq3_activity2)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "331edcc6",
   "metadata": {},
   "source": [
    "#### 🤖 CQ 4 🤖\n",
    "\n",
    "**Which robot is capable of executing all actions required for a given activity?**"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "bde2301c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "- https://example.org/tiagoRobot\n",
      "- https://example.org/tiagoRobot\n",
      "- https://example.org/hsrRobot\n"
     ]
    }
   ],
   "source": [
    "cq4_part1 = \"\"\"\n",
    "PREFIX pko: <https://w3id.org/pko#>\n",
    "PREFIX obot: <https://w3id.org/onto-bot#>\n",
    "\n",
    "SELECT DISTINCT ?reqAff\n",
    "WHERE {\n",
    "  ?activity pko:executesProcedure ?procedure .\n",
    "  ?procedure pko:hasStep ?step .\n",
    "  ?step pko:requiresAction ?action .\n",
    "  ?action obot:requiresAffordance ?reqAff . }\n",
    "\"\"\"\n",
    "\n",
    "cq4_part2 = \"\"\"\n",
    "PREFIX obot: <https://w3id.org/onto-bot#>\n",
    "PREFIX ros: <http://data.mksmart.org/onto-ros/class#>\n",
    "\n",
    "SELECT DISTINCT ?robot ?affordance\n",
    "WHERE {\n",
    "  ?robot a obot:Agent ;\n",
    "         obot:hasNode ?node .\n",
    "  ?node ros:communicatesThrough ?commComponent .\n",
    "  ?comm a ros:ROSCommunication ;\n",
    "         ros:hasComponent ?commComponent ;\n",
    "         ros:hasMessage ?msg .\n",
    "  ?msg ros:evokes ?capability .\n",
    "  ?capability obot:enablesAffordance ?affordance . }\n",
    "\"\"\"\n",
    "\n",
    "required_affordances_activity1 = set(str(row.reqAff) for row in g_activity1.query(cq4_part1))\n",
    "required_affordances_activity2 = set(str(row.reqAff) for row in g_activity2.query(cq4_part1))\n",
    "\n",
    "robot_affordances = defaultdict(set) \n",
    "for row in g_robots.query(cq4_part2): \n",
    "  robot_affordances[str(row.robot)].add(str(row.affordance))\n",
    "\n",
    "matching_robots_activity1 = [robot for robot, affs in robot_affordances.items()\n",
    "                  if required_affordances_activity1.issubset(affs)]\n",
    "\n",
    "matching_robots_activity2 = [robot for robot, affs in robot_affordances.items()\n",
    "                  if required_affordances_activity2.issubset(affs)]\n",
    "\n",
    "for r in matching_robots_activity1:\n",
    "    print(\"-\", r)\n",
    "for r in matching_robots_activity2:\n",
    "    print(\"-\", r) "
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5fab629a",
   "metadata": {},
   "source": [
    "#### 🤖 CQ 5 🤖\n",
    "\n",
    "**Given its capabilities, can robot X execute both the _\"Prepare breakfast\"_ and _\"Reorganise the kitchen\"_ activities?**"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "e14d9dee",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "✅ TIAGo Robot CAN execute both 'Prepare breakfast' and 'Reorganise the kitchen'\n"
     ]
    }
   ],
   "source": [
    "g_activities = Graph()\n",
    "g_activities += g_activity1\n",
    "g_activities += g_activity2\n",
    "\n",
    "cq5_part1 = \"\"\"\n",
    "PREFIX : <https://example.org/> \n",
    "PREFIX pko: <https://w3id.org/pko#>\n",
    "PREFIX obot: <https://w3id.org/onto-bot#>\n",
    "\n",
    "SELECT DISTINCT ?reqAff\n",
    "WHERE {\n",
    "  VALUES ?activity { :Activity1 :Activity2 }\n",
    "  ?activity pko:executesProcedure ?procedure .\n",
    "  ?procedure pko:hasStep ?step .\n",
    "  ?step pko:requiresAction ?action .\n",
    "  ?action obot:requiresAffordance ?reqAff . }\n",
    "\"\"\"\n",
    "\n",
    "cq5_part2 = \"\"\"\n",
    "PREFIX obot: <https://w3id.org/onto-bot#>\n",
    "PREFIX ros: <http://data.mksmart.org/onto-ros/class#>\n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "\n",
    "SELECT DISTINCT ?robotLabel ?affordance\n",
    "WHERE {\n",
    "  ?robot a obot:Agent ;\n",
    "         rdfs:label ?robotLabel ;\n",
    "         obot:hasNode ?node .\n",
    "  ?node ros:communicatesThrough ?commComponent .\n",
    "  ?comm a ros:ROSCommunication ;\n",
    "        ros:hasComponent ?commComponent ;\n",
    "        ros:hasMessage ?msg .\n",
    "  ?msg ros:evokes ?capability .\n",
    "  ?capability obot:enablesAffordance ?affordance . }\n",
    "\"\"\"\n",
    "\n",
    "required_affs = set(str(row.reqAff) for row in g_activities.query(cq5_part1))\n",
    "\n",
    "robot_affs = defaultdict(set)\n",
    "for row in g_robots.query(cq5_part2):\n",
    "    robot_affs[str(row.robotLabel)].add(str(row.affordance))\n",
    "\n",
    "for robot, affs in robot_affs.items():\n",
    "    if required_affs.issubset(affs):\n",
    "        print(f\"{robot} CAN execute both 'Prepare breakfast' and 'Reorganise the kitchen'\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "dd42a46d",
   "metadata": {},
   "source": [
    "#### 🤖 CQ 6 🤖\n",
    "\n",
    "**If not, which capabilities does Robot X lack, and which steps in the activity are unachievable as a result?**"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 77,
   "id": "94630592",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "🔎 Capability Gaps per Robot:\n",
      "\n",
      "🧠 Robot: HSR Robot\n",
      "  ❌ Step: Serve orange juice (Activity: Prepare breakfast)\n",
      "     Missing affordances:\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Pouring\n",
      "  ❌ Step: Serve milk (Activity: Prepare breakfast)\n",
      "     Missing affordances:\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Pouring\n",
      "  ❌ Step: Serve cereal (Activity: Prepare breakfast)\n",
      "     Missing affordances:\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Pouring\n",
      "  ❌ Step: Serve orange juice (Activity: Reorganise the kitchen)\n",
      "     Missing affordances:\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Pouring\n",
      "  ❌ Step: Serve milk (Activity: Reorganise the kitchen)\n",
      "     Missing affordances:\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Pouring\n",
      "  ❌ Step: Serve cereal (Activity: Reorganise the kitchen)\n",
      "     Missing affordances:\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Pouring\n",
      "\n",
      "🧠 Robot: TIAGo Robot\n",
      "  ✅ Can perform all steps in both activities.\n",
      "\n",
      "🧠 Robot: Stretch Robot\n",
      "  ❌ Step: Retrieve milk (Activity: Prepare breakfast)\n",
      "     Missing affordances:\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Holding\n",
      "  ❌ Step: Load bowl (Activity: Prepare breakfast)\n",
      "     Missing affordances:\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Holding\n",
      "  ❌ Step: Retrieve orange juice (Activity: Prepare breakfast)\n",
      "     Missing affordances:\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Holding\n",
      "  ❌ Step: Load glass (Activity: Prepare breakfast)\n",
      "     Missing affordances:\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Holding\n",
      "  ❌ Step: Retrieve cereal (Activity: Prepare breakfast)\n",
      "     Missing affordances:\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Holding\n",
      "  ❌ Step: Load spoon (Activity: Prepare breakfast)\n",
      "     Missing affordances:\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Holding\n",
      "  ❌ Step: Put away orange juice (Activity: Prepare breakfast)\n",
      "     Missing affordances:\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Holding\n",
      "  ❌ Step: Retrieve spoon (Activity: Prepare breakfast)\n",
      "     Missing affordances:\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Holding\n",
      "  ❌ Step: Put away milk (Activity: Prepare breakfast)\n",
      "     Missing affordances:\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Holding\n",
      "  ❌ Step: Retrieve bowl (Activity: Prepare breakfast)\n",
      "     Missing affordances:\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Holding\n",
      "  ❌ Step: Put away cereal (Activity: Prepare breakfast)\n",
      "     Missing affordances:\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Holding\n",
      "  ❌ Step: Retrieve glass (Activity: Prepare breakfast)\n",
      "     Missing affordances:\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Holding\n",
      "  ❌ Step: Serve orange juice (Activity: Prepare breakfast)\n",
      "     Missing affordances:\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Pouring\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Holding\n",
      "  ❌ Step: Serve milk (Activity: Prepare breakfast)\n",
      "     Missing affordances:\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Pouring\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Holding\n",
      "  ❌ Step: Serve cereal (Activity: Prepare breakfast)\n",
      "     Missing affordances:\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Pouring\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Holding\n",
      "  ❌ Step: Retrieve milk (Activity: Reorganise the kitchen)\n",
      "     Missing affordances:\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Holding\n",
      "  ❌ Step: Load bowl (Activity: Reorganise the kitchen)\n",
      "     Missing affordances:\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Holding\n",
      "  ❌ Step: Retrieve orange juice (Activity: Reorganise the kitchen)\n",
      "     Missing affordances:\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Holding\n",
      "  ❌ Step: Load glass (Activity: Reorganise the kitchen)\n",
      "     Missing affordances:\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Holding\n",
      "  ❌ Step: Retrieve cereal (Activity: Reorganise the kitchen)\n",
      "     Missing affordances:\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Holding\n",
      "  ❌ Step: Load spoon (Activity: Reorganise the kitchen)\n",
      "     Missing affordances:\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Holding\n",
      "  ❌ Step: Put away orange juice (Activity: Reorganise the kitchen)\n",
      "     Missing affordances:\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Holding\n",
      "  ❌ Step: Retrieve spoon (Activity: Reorganise the kitchen)\n",
      "     Missing affordances:\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Holding\n",
      "  ❌ Step: Put away milk (Activity: Reorganise the kitchen)\n",
      "     Missing affordances:\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Holding\n",
      "  ❌ Step: Retrieve bowl (Activity: Reorganise the kitchen)\n",
      "     Missing affordances:\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Holding\n",
      "  ❌ Step: Put away cereal (Activity: Reorganise the kitchen)\n",
      "     Missing affordances:\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Holding\n",
      "  ❌ Step: Retrieve glass (Activity: Reorganise the kitchen)\n",
      "     Missing affordances:\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Holding\n",
      "  ❌ Step: Serve orange juice (Activity: Reorganise the kitchen)\n",
      "     Missing affordances:\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Pouring\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Holding\n",
      "  ❌ Step: Serve milk (Activity: Reorganise the kitchen)\n",
      "     Missing affordances:\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Pouring\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Holding\n",
      "  ❌ Step: Serve cereal (Activity: Reorganise the kitchen)\n",
      "     Missing affordances:\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Pouring\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Holding\n",
      "\n",
      "🧠 Robot: UR3 Robot\n",
      "  ❌ Step: Retrieve milk (Activity: Prepare breakfast)\n",
      "     Missing affordances:\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Opening\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Closing\n",
      "  ❌ Step: Load bowl (Activity: Prepare breakfast)\n",
      "     Missing affordances:\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Opening\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Closing\n",
      "  ❌ Step: Retrieve orange juice (Activity: Prepare breakfast)\n",
      "     Missing affordances:\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Opening\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Closing\n",
      "  ❌ Step: Load glass (Activity: Prepare breakfast)\n",
      "     Missing affordances:\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Opening\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Closing\n",
      "  ❌ Step: Retrieve cereal (Activity: Prepare breakfast)\n",
      "     Missing affordances:\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Opening\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Closing\n",
      "  ❌ Step: Load spoon (Activity: Prepare breakfast)\n",
      "     Missing affordances:\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Opening\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Closing\n",
      "  ❌ Step: Put away orange juice (Activity: Prepare breakfast)\n",
      "     Missing affordances:\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Opening\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Closing\n",
      "  ❌ Step: Retrieve spoon (Activity: Prepare breakfast)\n",
      "     Missing affordances:\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Opening\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Closing\n",
      "  ❌ Step: Put away milk (Activity: Prepare breakfast)\n",
      "     Missing affordances:\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Opening\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Closing\n",
      "  ❌ Step: Retrieve bowl (Activity: Prepare breakfast)\n",
      "     Missing affordances:\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Opening\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Closing\n",
      "  ❌ Step: Put away cereal (Activity: Prepare breakfast)\n",
      "     Missing affordances:\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Opening\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Closing\n",
      "  ❌ Step: Retrieve glass (Activity: Prepare breakfast)\n",
      "     Missing affordances:\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Opening\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Closing\n",
      "  ❌ Step: Retrieve milk (Activity: Reorganise the kitchen)\n",
      "     Missing affordances:\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Opening\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Closing\n",
      "  ❌ Step: Load bowl (Activity: Reorganise the kitchen)\n",
      "     Missing affordances:\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Opening\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Closing\n",
      "  ❌ Step: Retrieve orange juice (Activity: Reorganise the kitchen)\n",
      "     Missing affordances:\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Opening\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Closing\n",
      "  ❌ Step: Load glass (Activity: Reorganise the kitchen)\n",
      "     Missing affordances:\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Opening\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Closing\n",
      "  ❌ Step: Retrieve cereal (Activity: Reorganise the kitchen)\n",
      "     Missing affordances:\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Opening\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Closing\n",
      "  ❌ Step: Load spoon (Activity: Reorganise the kitchen)\n",
      "     Missing affordances:\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Opening\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Closing\n",
      "  ❌ Step: Put away orange juice (Activity: Reorganise the kitchen)\n",
      "     Missing affordances:\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Opening\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Closing\n",
      "  ❌ Step: Retrieve spoon (Activity: Reorganise the kitchen)\n",
      "     Missing affordances:\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Opening\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Closing\n",
      "  ❌ Step: Put away milk (Activity: Reorganise the kitchen)\n",
      "     Missing affordances:\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Opening\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Closing\n",
      "  ❌ Step: Retrieve bowl (Activity: Reorganise the kitchen)\n",
      "     Missing affordances:\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Opening\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Closing\n",
      "  ❌ Step: Put away cereal (Activity: Reorganise the kitchen)\n",
      "     Missing affordances:\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Opening\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Closing\n",
      "  ❌ Step: Retrieve glass (Activity: Reorganise the kitchen)\n",
      "     Missing affordances:\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Opening\n",
      "     - http://www.ease-crc.org/ont/SOMA.owl#Closing\n",
      "\n"
     ]
    }
   ],
   "source": [
    "g_all = g_activities + g_robots\n",
    "\n",
    "cq6_part1 = \"\"\"\n",
    "PREFIX : <https://example.org/>\n",
    "PREFIX pko: <https://w3id.org/pko#>\n",
    "PREFIX obot: <https://w3id.org/onto-bot#>\n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "\n",
    "SELECT DISTINCT ?activityLabel ?stepLabel ?affordance\n",
    "WHERE {\n",
    "  VALUES ?activity { :Activity1 :Activity2 }\n",
    "  ?activity pko:hasUserQuestionOccurrence ?uqo ;\n",
    "      pko:executesProcedure ?procedure .\n",
    "  ?uqo rdfs:label ?activityLabel .\n",
    "  ?procedure pko:hasStep ?step .\n",
    "  ?step rdfs:label ?stepLabel ;\n",
    "        pko:requiresAction ?action .\n",
    "  ?action obot:requiresAffordance ?affordance . }\n",
    "\"\"\"\n",
    "\n",
    "cq6_part2 = \"\"\"\n",
    "PREFIX obot: <https://w3id.org/onto-bot#>\n",
    "PREFIX ros: <http://data.mksmart.org/onto-ros/class#>\n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "\n",
    "SELECT DISTINCT ?robotLabel ?affordance\n",
    "WHERE {\n",
    "  ?robot a obot:Agent ;\n",
    "         rdfs:label ?robotLabel ;\n",
    "         obot:hasNode ?node .\n",
    "  ?node ros:communicatesThrough ?commComponent .\n",
    "\n",
    "  ?comm a ros:ROSCommunication ;\n",
    "        ros:hasComponent ?commComponent ;\n",
    "        ros:hasMessage ?msg .\n",
    "\n",
    "  ?msg ros:evokes ?capability .\n",
    "  ?capability obot:enablesAffordance ?affordance . }\n",
    "\"\"\"\n",
    "\n",
    "step_requirements = defaultdict(set)\n",
    "\n",
    "for row in g_all.query(cq6_part1):\n",
    "    key = (str(row.activityLabel), str(row.stepLabel))\n",
    "    step_requirements[key].add(str(row.affordance))\n",
    "\n",
    "# --- Step 2: Build affordances per robot ---\n",
    "robot_affordances = defaultdict(set)\n",
    "\n",
    "for row in g_all.query(cq6_part2):\n",
    "    robot_affordances[str(row.robotLabel)].add(str(row.affordance))\n",
    "\n",
    "# --- Step 3: Compare and report missing capabilities ---\n",
    "print(\"🔎 Capability Gaps per Robot:\\n\")\n",
    "\n",
    "for robot, affordances in robot_affordances.items():\n",
    "    print(f\"🧠 Robot: {robot}\")\n",
    "    any_missing = False\n",
    "    for (activity, step), reqs in step_requirements.items():\n",
    "        missing = reqs - affordances\n",
    "        if missing:\n",
    "            any_missing = True\n",
    "            print(f\"  ❌ Step: {step} (Activity: {activity})\")\n",
    "            print(\"     Missing affordances:\")\n",
    "            for m in missing:\n",
    "                print(f\"     - {m}\")\n",
    "    if not any_missing:\n",
    "        print(\"  ✅ Can perform all steps in both activities.\")\n",
    "    print()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "1fb09193",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "base",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.2"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
